<a href="https://colab.research.google.com/github/edcalderin/BigDataEngineering_ICARO/blob/master/TP_Integrador.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Trabajo integrador

## Parte 1

**Objetivo**: El objetivo de la Parte 1 consta de dos secciones que se deberán resolver utilizando python (request, pandas, etc.) y PostgreSQL.


1.   Consultar una base de datos relacional (sistema OLTP) en Postgres siguiendo el DER (diagrama de entidad relación) propuesto.
2.   Construir, consultar y persistir (en csv) una tabla denormalizada (más adelante se aclara su formato) con datos agrupados por distintas categorías.

### Creando conexión a Postgres

In [62]:
from sqlalchemy import create_engine
import pandas as pd

In [3]:
def getPostgresConnection(stringConnection='postgresql+psycopg2://postgres:postgres@db-test.cq4syw9xqygb.us-east-1.rds.amazonaws.com/postgres'):
    return create_engine(stringConnection)

Test conexion

In [4]:
connector = getPostgresConnection()
with connector.connect() as connection:
    result = connection.execute('SELECT VERSION()')
    print(result.fetchone())

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

('PostgreSQL 12.5 on x86_64-pc-linux-gnu, compiled by gcc (GCC) 4.8.5 20150623 (Red Hat 4.8.5-11), 64-bit',)

### Consultas a la base de datos

Creando objeto global

In [5]:
connector = getPostgresConnection()

#### 1. Cantidad de ventas totales

In [ ]:
with connector.connect() as connection:
    result = connection.execute('SELECT COUNT(*) FROM Ventas')
    print(f'{result.fetchone()[0]} ventas totales')

100 ventas totales

#### 2. Cantidad de clientes totales.

In [ ]:
with connector.connect() as connection:
    result = connection.execute('SELECT COUNT(*) FROM Clientes')
    print(f'{result.fetchone()[0]} clientes totales')

5 clientes totales

#### 3. Cantidad de clientes por región (mostrando la región, no el id)

In [ ]:
with connector.connect() as connection:
    query = '''
            SELECT R.region, COUNT(C.id_region) FROM Clientes C
            INNER JOIN Regiones R USING (id_region)
            GROUP BY(R.region)
            '''
    result = connection.execute(query)
    for item in result.fetchall():
        print(item)

('Sur', 3)
('Norte', 2)

#### 4. Cantidad de productos por categoría (mostrando la categoría, no el id)

In [ ]:
with connector.connect() as connection:
    query = '''
            SELECT nombre_categoria, COUNT(id_producto) FROM Productos
            INNER JOIN Categoria_Producto USING (id_categoria_producto)
            GROUP BY(nombre_categoria)
            '''
    result = connection.execute(query)
    for item in result.fetchall():
        print(item)

('Smartphone', 5)
('Hogar', 2)
('Computacion', 2)

#### 5. Cantidad de ventas por región

In [ ]:
with connector.connect() as connection:
    query = '''
            SELECT R.region, COUNT(C.id_region) FROM Ventas V
            INNER JOIN Clientes C ON V.id_cliente = C.id_cliente
            INNER JOIN Regiones R ON R.id_region = C.id_region
            GROUP BY (R.region)
            '''
    result = connection.execute(query)
    for item in result.fetchall():
        print(item)

('Sur', 83)
('Norte', 17)

#### 6. Producto más vendido en cada región

In [8]:
with connector.connect() as connection:
    query = '''DROP VIEW IF EXISTS venta_producto_view;
            CREATE VIEW venta_producto_view AS
            (
                SELECT id_cliente, id_producto, nombre_producto FROM Ventas V
                INNER JOIN Ventas_Productos VP USING (id_venta)
                INNER JOIN Productos P USING (id_producto)
            );
            SELECT * FROM venta_producto_view
            '''
    result = connection.execute(query)
    print('Id_cliente | id_produto | nombre_producto')
    for item in result.fetchmany(10):
        print(item)

Id_cliente | id_produto | nombre_producto
(3, 1, 'Iphone X')
(5, 1, 'Iphone X')
(5, 1, 'Iphone X')
(5, 1, 'Iphone X')
(3, 1, 'Iphone X')
(3, 1, 'Iphone X')
(5, 1, 'Iphone X')
(3, 1, 'Iphone X')
(5, 1, 'Iphone X')
(4, 1, 'Iphone X')

In [9]:
with connector.connect() as connection:
    query = '''
            DROP VIEW IF EXISTS cliente_region_view;
            CREATE VIEW cliente_region_view AS
            (
                SELECT id_cliente, id_region, region FROM Clientes C
                INNER JOIN Regiones R USING (id_region)
            );
            SELECT * FROM cliente_region_view
            '''
    result = connection.execute(query)
    print('Id_cliente | id_region | region')
    for item in result.fetchmany(10):
        print(item)

Id_cliente | id_region | region
(1, 1, 'Norte')
(2, 1, 'Norte')
(3, 2, 'Sur')
(4, 2, 'Sur')
(5, 2, 'Sur')

In [10]:
with connector.connect() as connection:
    query = ''' DROP VIEW IF EXISTS region_cantidad_produto_view;
                CREATE VIEW region_cantidad_produto_view AS (
                    SELECT region, nombre_producto, COUNT(nombre_producto) AS cantidad FROM venta_producto_view
                    INNER JOIN cliente_region_view 
                    USING (id_cliente) 
                    GROUP BY (region, nombre_producto)
                );
                SELECT * FROM region_cantidad_produto_view
    '''
    result = connection.execute(query)
    print('Region | Nombre_producto | Cantidad vendida')
    for item in result.fetchall():
        print(item)

Region | Nombre_producto | Cantidad vendida
('Norte', 'Monito 27"', 1)
('Sur', 'Monito 27"', 12)
('Norte', 'RAM 8GB ', 2)
('Norte', 'Moto G9', 2)
('Norte', 'Lavarropas Drean Next Eco', 2)
('Sur', 'RAM 8GB ', 2)
('Norte', 'Cocina Electrolux', 2)
('Norte', 'Iphone 7', 4)
('Sur', 'Iphone X', 15)
('Sur', 'Samsung S20', 11)
('Sur', 'Lavarropas Drean Next Eco', 5)
('Sur', 'Moto G9', 13)
('Sur', 'Iphone 7', 8)
('Sur', 'Cocina Electrolux', 9)
('Norte', 'Moto E9', 4)
('Sur', 'Moto E9', 8)

In [ ]:
query = ''' SELECT region, nombre_producto FROM (
                    SELECT region, MAX(cantidad) cant_max FROM region_cantidad_produto_view
                    GROUP BY region
                ) region_max
                INNER JOIN region_cantidad_produto_view USING (region)
                WHERE cantidad = cant_max
            '''
pd.read_sql(query, connector)

  region nombre_producto
0  Norte        Iphone 7
1    Sur        Iphone X
2  Norte         Moto E9

#### 7. Cliente con más productos comprados por región

In [11]:
with connector.connect() as connection:
    query = '''
            DROP VIEW IF EXISTS region_client_prod;
            CREATE VIEW region_client_prod AS (
                SELECT region, Id_cliente, cant_products FROM (
                    SELECT Id_cliente, region, COUNT(*) as cant_products FROM venta_producto_view
                    INNER JOIN cliente_region_view USING (Id_cliente)
                    GROUP BY (region, Id_cliente)
                ) region_cant_prods
            );
            SELECT * FROM region_client_prod
            '''
    result = connection.execute(query)
    print('region | Id_cliente | cant_products')
    for item in result.fetchall():
        print(item)

region | Id_cliente | cant_products
('Sur', 3, 53)
('Norte', 1, 11)
('Norte', 2, 6)
('Sur', 5, 23)
('Sur', 4, 7)

In [ ]:
query = '''
        SELECT region, nombre, apellido FROM (
            SELECT region, MAX(cant_products) AS cant_prod FROM region_client_prod
            GROUP BY (region)
        ) subquery1
        INNER JOIN region_client_prod USING (region)
        INNER JOIN Clientes USING (Id_cliente)
        WHERE cant_prod = cant_products
        '''
pd.read_sql(query, connector)

  region  nombre apellido
0    Sur  Homero  Simpson
1  Norte    Juan    Perez

#### 8. Cliente que más gasta por región

In [58]:
with connector.connect() as connection:
    query = '''
                DROP VIEW IF EXISTS price_client_region_view;
                CREATE VIEW price_client_region_view AS (
                    SELECT (nombre || ' ' || apellido) AS full_name, region, sum_precio FROM cliente_region_view
                    INNER JOIN (
                        SELECT id_cliente, SUM(precio) AS sum_precio FROM venta_producto_view
                        INNER JOIN Productos USING (id_producto)
                        GROUP BY id_cliente) subquery
                    USING (id_cliente)
                    INNER JOIN Clientes USING (id_cliente)
                );
                SELECT * FROM price_client_region_view            
            '''
    result = connection.execute(query)
    print('full_name | region | sum_precio')
    for item in result.fetchall():
        print(item)

full_name | region | sum_precio
('Juan Perez', 'Norte', Decimal('2490'))
('Nicolas Garcia', 'Norte', Decimal('1230'))
('Homero Simpson', 'Sur', Decimal('24470'))
('Carlos Hernandez', 'Sur', Decimal('2310'))
('Paula Herrera', 'Sur', Decimal('10230'))

In [61]:
query = '''
        SELECT region, full_name, sum_precio FROM price_client_region_view
        INNER JOIN (
            SELECT region, MAX(sum_precio) AS total FROM price_client_region_view
            GROUP BY region
        ) grouped_by_region
        USING (region)
        WHERE sum_precio = total           
        '''
pd.read_sql(query, connector)

  region       full_name  sum_precio
0  Norte      Juan Perez      2490.0
1    Sur  Homero Simpson     24470.0

#### 9. Monto total de ventas por categoría de producto (mostrandola categoría, noel id)

### Dropping Views

In [7]:
with connector.connect() as connection:
    # Eliminando vistas a partir de la última creada
    query = '''
            DROP VIEW IF EXISTS price_client_region_view;
            DROP VIEW IF EXISTS region_client_prod;
            DROP VIEW IF EXISTS region_cantidad_produto_view;
            DROP VIEW IF EXISTS cliente_region_view;
            DROP VIEW IF EXISTS venta_producto_view;
            '''
    result = connection.execute(query)